print("Зараз буде соц опитування на 10 питань")
l = input("Готовий? (так/ні):  ")

if l.lower() == "так":
    print("Добре, тоді погнали")
else:
    print("Окей, бувай")
    exit()

score = 0

a = input("Яка столиця Іспанії?  ")
if a.lower() == "мадрид":
    print("Правильно +1 бал")
    score += 1
else:
    print("Неправильно.")

b = input("Яка сама найлегендарніша людина на землі?  ")
if b.lower() == "билли херингтон":
    print("Правильно +1 бал")
    score += 1
else:
    print("Неправильно.")

s1 = input("Ти любиш Україну?  ")
if s1.lower() == "так":
    print("Правильно +1 бал")
    score += 1
else:
    print("Неправильно.")

print(f"Твій загальний бал: {score}/3")

u = input("Чіна?  ")
if u.lower() == "чіна":
    print("Правильно +1 бал")
    score += 1
else:
    print("Неправильно.")

print(f"Твій загальний бал: {score}/4")

d = input("Яка сама найбільша область України?  ")
if d.lower() == "одеська":
    print("Правильно +1 бал")
    score += 1
else:
    print("Неправильно.")

print(f"Твій загальний бал: {score}/5")

k = input("Яка сама найменша область України?  ")
if k.lower() == "чернівецька":
    print("Правильно +1 бал")
    score += 1
else:
    print("Неправильно.")

print(f"Твій загальний бал: {score}/6")

p = input("Яка столиця США?  ")
if p.lower() == "вашингтон":
    print("Правильно +1 бал")
    score += 1
else:
    print("Неправильно.")

print(f"Твій загальний бал: {score}/7")

g = input("Ти молодець?  ")
if g.lower() == "так":
    print("Правильно +1 бал")
    score += 1
else:
    print("Неправильно.")

print(f"Твій загальний бал: {score}/8")

z = input("Яка столиця Бразилії?  ")
if z.lower() == "бразиліа":
    print("Правильно +1 бал")
    score += 1
else:
    print("Неправильно.")

print(f"Твій загальний бал: {score}/9")

s = input("Який самий класний напій?  ")
if s.lower() == "квас":
    print("Правильно +1 бал")
    score += 1
else:
    print("Неправильно.")

print(f"Твій загальний бал: {score}/10")
